TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v18.1.2.LTS *
       3                    ;* Date/Time created: Thu Jun 14 14:56:57 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/net/wifi
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v18.1.2.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/net/
      13                            .global SlNetIfConfigWifi

    6104                            .dwattr $C$DW$609, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slnets
    6105                            .dwattr $C$DW$609, DW_AT_decl_line(0x12b)
    6106                            .dwattr $C$DW$609, DW_AT_decl_column(0x05)
    6107                    
    6108                    $C$DW$610       .dwtag  DW_TAG_enumerator
    6109                            .dwattr $C$DW$610, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
    6110                            .dwattr $C$DW$610, DW_AT_const_value(0x04)
    6111                            .dwattr $C$DW$610, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slnets
    6112                            .dwattr $C$DW$610, DW_AT_decl_line(0x12c)
    6113                            .dwattr $C$DW$610, DW_AT_decl_column(0x05)
    6114                    
    6115                    $C$DW$611       .dwtag  DW_TAG_enumerator
    6116                            .dwattr $C$DW$611, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
    6117                            .dwattr $C$DW$611, DW_AT_const_value(0x05)
    6118                            .dwattr $C$DW$611, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slnets
    6119                            .dwattr $C$DW$611, DW_AT_decl_line(0x12d)
    6120                            .dwattr $C$DW$611, DW_AT_decl_column(0x05)
    6121                    
    6122                    $C$DW$612       .dwtag  DW_TAG_enumerator
    6123                            .dwattr $C$DW$612, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
    6124                            .dwattr $C$DW$612, DW_AT_const_value(0x06)
    6125                            .dwattr $C$DW$612, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slnets
    6126                            .dwattr $C$DW$612, DW_AT_decl_line(0x12e)
    6127                            .dwattr $C$DW$612, DW_AT_decl_column(0x05)
    6128                    
    6129                            .dwattr $C$DW$T$517, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slne
    6130                            .dwattr $C$DW$T$517, DW_AT_decl_line(0x128)
    6131                            .dwattr $C$DW$T$517, DW_AT_decl_column(0x01)
    6132                            .dwendtag $C$DW$T$517
    6133                    
    6134                    $C$DW$T$518     .dwtag  DW_TAG_typedef
    6135                            .dwattr $C$DW$T$518, DW_AT_name("SlNetSockTxInhibitThreshold_e")
    6136                            .dwattr $C$DW$T$518, DW_AT_type(*$C$DW$T$517)
    6137                            .dwattr $C$DW$T$518, DW_AT_language(DW_LANG_C)
    6138                            .dwattr $C$DW$T$518, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slne
    6139                            .dwattr $C$DW$T$518, DW_AT_decl_line(0x12f)
    6140                            .dwattr $C$DW$T$518, DW_AT_decl_column(0x03)
    6141                    
    6142                    
    6143                    $C$DW$T$519     .dwtag  DW_TAG_enumeration_type
    6144                            .dwattr $C$DW$T$519, DW_AT_byte_size(0x01)
    6145                    $C$DW$613       .dwtag  DW_TAG_enumerator
    6146                            .dwattr $C$DW$613, DW_AT_name("SLNETIF_STATE_DISABLE")
    6147                            .dwattr $C$DW$613, DW_AT_const_value(0x00)
    6148                            .dwattr $C$DW$613, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slneti
    6149                            .dwattr $C$DW$613, DW_AT_decl_line(0x65)
    6150                            .dwattr $C$DW$613, DW_AT_decl_column(0x05)
    6151                    
    6152                    $C$DW$614       .dwtag  DW_TAG_enumerator
    6153                            .dwattr $C$DW$614, DW_AT_name("SLNETIF_STATE_ENABLE")
    6154                            .dwattr $C$DW$614, DW_AT_const_value(0x01)
    6155                            .dwattr $C$DW$614, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slneti
    6156                            .dwattr $C$DW$614, DW_AT_decl_line(0x66)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  113

    6157                            .dwattr $C$DW$614, DW_AT_decl_column(0x05)
    6158                    
    6159                            .dwattr $C$DW$T$519, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slne
    6160                            .dwattr $C$DW$T$519, DW_AT_decl_line(0x64)
    6161                            .dwattr $C$DW$T$519, DW_AT_decl_column(0x01)
    6162                            .dwendtag $C$DW$T$519
    6163                    
    6164                    $C$DW$T$520     .dwtag  DW_TAG_typedef
    6165                            .dwattr $C$DW$T$520, DW_AT_name("SlNetIfState_e")
    6166                            .dwattr $C$DW$T$520, DW_AT_type(*$C$DW$T$519)
    6167                            .dwattr $C$DW$T$520, DW_AT_language(DW_LANG_C)
    6168                            .dwattr $C$DW$T$520, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/net/slne
    6169                            .dwattr $C$DW$T$520, DW_AT_decl_line(0x67)
    6170                            .dwattr $C$DW$T$520, DW_AT_decl_column(0x03)
    6171                    
    6172                    
    6173                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6174                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x28)
    6175                    $C$DW$615       .dwtag  DW_TAG_member
    6176                            .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$6)
    6177                            .dwattr $C$DW$615, DW_AT_name("SsidLen")
    6178                            .dwattr $C$DW$615, DW_AT_TI_symbol_name("SsidLen")
    6179                            .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6180                            .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6181                            .dwattr $C$DW$615, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6182                            .dwattr $C$DW$615, DW_AT_decl_line(0x203)
    6183                            .dwattr $C$DW$615, DW_AT_decl_column(0x0d)
    6184                    
    6185                    $C$DW$616       .dwtag  DW_TAG_member
    6186                            .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$23)
    6187                            .dwattr $C$DW$616, DW_AT_name("SsidName")
    6188                            .dwattr $C$DW$616, DW_AT_TI_symbol_name("SsidName")
    6189                            .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6190                            .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6191                            .dwattr $C$DW$616, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6192                            .dwattr $C$DW$616, DW_AT_decl_line(0x204)
    6193                            .dwattr $C$DW$616, DW_AT_decl_column(0x0d)
    6194                    
    6195                    $C$DW$617       .dwtag  DW_TAG_member
    6196                            .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$24)
    6197                            .dwattr $C$DW$617, DW_AT_name("Bssid")
    6198                            .dwattr $C$DW$617, DW_AT_TI_symbol_name("Bssid")
    6199                            .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6200                            .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6201                            .dwattr $C$DW$617, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6202                            .dwattr $C$DW$617, DW_AT_decl_line(0x205)
    6203                            .dwattr $C$DW$617, DW_AT_decl_column(0x0d)
    6204                    
    6205                    $C$DW$618       .dwtag  DW_TAG_member
    6206                            .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$6)
    6207                            .dwattr $C$DW$618, DW_AT_name("Padding")
    6208                            .dwattr $C$DW$618, DW_AT_TI_symbol_name("Padding")
    6209                            .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6210                            .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6211                            .dwattr $C$DW$618, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  114

    6212                            .dwattr $C$DW$618, DW_AT_decl_line(0x206)
    6213                            .dwattr $C$DW$618, DW_AT_decl_column(0x0d)
    6214                    
    6215                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6216                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x202)
    6217                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    6218                            .dwendtag $C$DW$T$25
    6219                    
    6220                    $C$DW$T$211     .dwtag  DW_TAG_typedef
    6221                            .dwattr $C$DW$T$211, DW_AT_name("SlWlanEventConnect_t")
    6222                            .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$25)
    6223                            .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    6224                            .dwattr $C$DW$T$211, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    6225                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x207)
    6226                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x03)
    6227                    
    6228                    
    6229                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    6230                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x4c)
    6231                    $C$DW$619       .dwtag  DW_TAG_member
    6232                            .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$6)
    6233                            .dwattr $C$DW$619, DW_AT_name("SsidLen")
    6234                            .dwattr $C$DW$619, DW_AT_TI_symbol_name("SsidLen")
    6235                            .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6236                            .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6237                            .dwattr $C$DW$619, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6238                            .dwattr $C$DW$619, DW_AT_decl_line(0x21a)
    6239                            .dwattr $C$DW$619, DW_AT_decl_column(0x0d)
    6240                    
    6241                    $C$DW$620       .dwtag  DW_TAG_member
    6242                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$23)
    6243                            .dwattr $C$DW$620, DW_AT_name("SsidName")
    6244                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("SsidName")
    6245                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6246                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6247                            .dwattr $C$DW$620, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6248                            .dwattr $C$DW$620, DW_AT_decl_line(0x21b)
    6249                            .dwattr $C$DW$620, DW_AT_decl_column(0x0d)
    6250                    
    6251                    $C$DW$621       .dwtag  DW_TAG_member
    6252                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$24)
    6253                            .dwattr $C$DW$621, DW_AT_name("Bssid")
    6254                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("Bssid")
    6255                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6256                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6257                            .dwattr $C$DW$621, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6258                            .dwattr $C$DW$621, DW_AT_decl_line(0x21c)
    6259                            .dwattr $C$DW$621, DW_AT_decl_column(0x0d)
    6260                    
    6261                    $C$DW$622       .dwtag  DW_TAG_member
    6262                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$6)
    6263                            .dwattr $C$DW$622, DW_AT_name("Reserved")
    6264                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("Reserved")
    6265                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6266                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  115

    6267                            .dwattr $C$DW$622, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6268                            .dwattr $C$DW$622, DW_AT_decl_line(0x21d)
    6269                            .dwattr $C$DW$622, DW_AT_decl_column(0x0d)
    6270                    
    6271                    $C$DW$623       .dwtag  DW_TAG_member
    6272                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$6)
    6273                            .dwattr $C$DW$623, DW_AT_name("GoDeviceNameLen")
    6274                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("GoDeviceNameLen")
    6275                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6276                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6277                            .dwattr $C$DW$623, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6278                            .dwattr $C$DW$623, DW_AT_decl_line(0x21e)
    6279                            .dwattr $C$DW$623, DW_AT_decl_column(0x0d)
    6280                    
    6281                    $C$DW$624       .dwtag  DW_TAG_member
    6282                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$23)
    6283                            .dwattr $C$DW$624, DW_AT_name("GoDeviceName")
    6284                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("GoDeviceName")
    6285                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6286                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6287                            .dwattr $C$DW$624, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6288                            .dwattr $C$DW$624, DW_AT_decl_line(0x21f)
    6289                            .dwattr $C$DW$624, DW_AT_decl_column(0x0d)
    6290                    
    6291                    $C$DW$625       .dwtag  DW_TAG_member
    6292                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$26)
    6293                            .dwattr $C$DW$625, DW_AT_name("Padding")
    6294                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("Padding")
    6295                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    6296                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6297                            .dwattr $C$DW$625, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6298                            .dwattr $C$DW$625, DW_AT_decl_line(0x220)
    6299                            .dwattr $C$DW$625, DW_AT_decl_column(0x0d)
    6300                    
    6301                            .dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6302                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x219)
    6303                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    6304                            .dwendtag $C$DW$T$27
    6305                    
    6306                    $C$DW$T$212     .dwtag  DW_TAG_typedef
    6307                            .dwattr $C$DW$T$212, DW_AT_name("SlWlanEventP2PConnect_t")
    6308                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$27)
    6309                            .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    6310                            .dwattr $C$DW$T$212, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    6311                            .dwattr $C$DW$T$212, DW_AT_decl_line(0x221)
    6312                            .dwattr $C$DW$T$212, DW_AT_decl_column(0x03)
    6313                    
    6314                    
    6315                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6316                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x50)
    6317                    $C$DW$626       .dwtag  DW_TAG_member
    6318                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$6)
    6319                            .dwattr $C$DW$626, DW_AT_name("Mode")
    6320                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("Mode")
    6321                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  116

    6322                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6323                            .dwattr $C$DW$626, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6324                            .dwattr $C$DW$626, DW_AT_decl_line(0x2c8)
    6325                            .dwattr $C$DW$626, DW_AT_decl_column(0x09)
    6326                    
    6327                    $C$DW$627       .dwtag  DW_TAG_member
    6328                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$6)
    6329                            .dwattr $C$DW$627, DW_AT_name("ConnStatus")
    6330                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("ConnStatus")
    6331                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6332                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6333                            .dwattr $C$DW$627, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6334                            .dwattr $C$DW$627, DW_AT_decl_line(0x2c9)
    6335                            .dwattr $C$DW$627, DW_AT_decl_column(0x09)
    6336                    
    6337                    $C$DW$628       .dwtag  DW_TAG_member
    6338                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$6)
    6339                            .dwattr $C$DW$628, DW_AT_name("SecType")
    6340                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("SecType")
    6341                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6342                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6343                            .dwattr $C$DW$628, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6344                            .dwattr $C$DW$628, DW_AT_decl_line(0x2ca)
    6345                            .dwattr $C$DW$628, DW_AT_decl_column(0x09)
    6346                    
    6347                    $C$DW$629       .dwtag  DW_TAG_member
    6348                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$6)
    6349                            .dwattr $C$DW$629, DW_AT_name("Reserved")
    6350                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("Reserved")
    6351                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6352                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6353                            .dwattr $C$DW$629, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6354                            .dwattr $C$DW$629, DW_AT_decl_line(0x2cb)
    6355                            .dwattr $C$DW$629, DW_AT_decl_column(0x09)
    6356                    
    6357                    $C$DW$630       .dwtag  DW_TAG_member
    6358                            .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$28)
    6359                            .dwattr $C$DW$630, DW_AT_name("ConnectionInfo")
    6360                            .dwattr $C$DW$630, DW_AT_TI_symbol_name("ConnectionInfo")
    6361                            .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6362                            .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6363                            .dwattr $C$DW$630, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6364                            .dwattr $C$DW$630, DW_AT_decl_line(0x2cc)
    6365                            .dwattr $C$DW$630, DW_AT_decl_column(0x1c)
    6366                    
    6367                            .dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6368                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x2c7)
    6369                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    6370                            .dwendtag $C$DW$T$29
    6371                    
    6372                    $C$DW$T$521     .dwtag  DW_TAG_typedef
    6373                            .dwattr $C$DW$T$521, DW_AT_name("SlWlanConnStatusParam_t")
    6374                            .dwattr $C$DW$T$521, DW_AT_type(*$C$DW$T$29)
    6375                            .dwattr $C$DW$T$521, DW_AT_language(DW_LANG_C)
    6376                            .dwattr $C$DW$T$521, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  117

    6377                            .dwattr $C$DW$T$521, DW_AT_decl_line(0x2cd)
    6378                            .dwattr $C$DW$T$521, DW_AT_decl_column(0x02)
    6379                    
    6380                    
    6381                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6382                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    6383                    $C$DW$631       .dwtag  DW_TAG_member
    6384                            .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$14)
    6385                            .dwattr $C$DW$631, DW_AT_name("__max_align1")
    6386                            .dwattr $C$DW$631, DW_AT_TI_symbol_name("__max_align1")
    6387                            .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6388                            .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6389                            .dwattr $C$DW$631, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6390                            .dwattr $C$DW$631, DW_AT_decl_line(0x70)
    6391                            .dwattr $C$DW$631, DW_AT_decl_column(0x0c)
    6392                    
    6393                    $C$DW$632       .dwtag  DW_TAG_member
    6394                            .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$18)
    6395                            .dwattr $C$DW$632, DW_AT_name("__max_align2")
    6396                            .dwattr $C$DW$632, DW_AT_TI_symbol_name("__max_align2")
    6397                            .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6398                            .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6399                            .dwattr $C$DW$632, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6400                            .dwattr $C$DW$632, DW_AT_decl_line(0x71)
    6401                            .dwattr $C$DW$632, DW_AT_decl_column(0x0e)
    6402                    
    6403                            .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2
    6404                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x6f)
    6405                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    6406                            .dwendtag $C$DW$T$30
    6407                    
    6408                    $C$DW$T$523     .dwtag  DW_TAG_typedef
    6409                            .dwattr $C$DW$T$523, DW_AT_name("__max_align_t")
    6410                            .dwattr $C$DW$T$523, DW_AT_type(*$C$DW$T$30)
    6411                            .dwattr $C$DW$T$523, DW_AT_language(DW_LANG_C)
    6412                            .dwattr $C$DW$T$523, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6413                            .dwattr $C$DW$T$523, DW_AT_decl_line(0x72)
    6414                            .dwattr $C$DW$T$523, DW_AT_decl_column(0x03)
    6415                    
    6416                    
    6417                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6418                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    6419                    $C$DW$633       .dwtag  DW_TAG_member
    6420                            .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$8)
    6421                            .dwattr $C$DW$633, DW_AT_name("daylight")
    6422                            .dwattr $C$DW$633, DW_AT_TI_symbol_name("daylight")
    6423                            .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6424                            .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6425                            .dwattr $C$DW$633, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6426                            .dwattr $C$DW$633, DW_AT_decl_line(0x93)
    6427                            .dwattr $C$DW$633, DW_AT_decl_column(0x0b)
    6428                    
    6429                    $C$DW$634       .dwtag  DW_TAG_member
    6430                            .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$12)
    6431                            .dwattr $C$DW$634, DW_AT_name("timezone")
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  118

    6432                            .dwattr $C$DW$634, DW_AT_TI_symbol_name("timezone")
    6433                            .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6434                            .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    6435                            .dwattr $C$DW$634, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6436                            .dwattr $C$DW$634, DW_AT_decl_line(0x94)
    6437                            .dwattr $C$DW$634, DW_AT_decl_column(0x0b)
    6438                    
    6439                    $C$DW$635       .dwtag  DW_TAG_member
    6440                            .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$32)
    6441                            .dwattr $C$DW$635, DW_AT_name("tzname")
    6442                            .dwattr $C$DW$635, DW_AT_TI_symbol_name("tzname")
    6443                            .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6444                            .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6445                            .dwattr $C$DW$635, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6446                            .dwattr $C$DW$635, DW_AT_decl_line(0x95)
    6447                            .dwattr $C$DW$635, DW_AT_decl_column(0x0b)
    6448                    
    6449                    $C$DW$636       .dwtag  DW_TAG_member
    6450                            .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$32)
    6451                            .dwattr $C$DW$636, DW_AT_name("dstname")
    6452                            .dwattr $C$DW$636, DW_AT_TI_symbol_name("dstname")
    6453                            .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6454                            .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6455                            .dwattr $C$DW$636, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6456                            .dwattr $C$DW$636, DW_AT_decl_line(0x96)
    6457                            .dwattr $C$DW$636, DW_AT_decl_column(0x0b)
    6458                    
    6459                            .dwattr $C$DW$T$33, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2
    6460                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x92)
    6461                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    6462                            .dwendtag $C$DW$T$33
    6463                    
    6464                    $C$DW$T$524     .dwtag  DW_TAG_typedef
    6465                            .dwattr $C$DW$T$524, DW_AT_name("TZ")
    6466                            .dwattr $C$DW$T$524, DW_AT_type(*$C$DW$T$33)
    6467                            .dwattr $C$DW$T$524, DW_AT_language(DW_LANG_C)
    6468                            .dwattr $C$DW$T$524, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6469                            .dwattr $C$DW$T$524, DW_AT_decl_line(0x97)
    6470                            .dwattr $C$DW$T$524, DW_AT_decl_column(0x03)
    6471                    
    6472                    
    6473                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6474                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    6475                    $C$DW$637       .dwtag  DW_TAG_member
    6476                            .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$36)
    6477                            .dwattr $C$DW$637, DW_AT_name("pEntry")
    6478                            .dwattr $C$DW$637, DW_AT_TI_symbol_name("pEntry")
    6479                            .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6480                            .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6481                            .dwattr $C$DW$637, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6482                            .dwattr $C$DW$637, DW_AT_decl_line(0x74)
    6483                            .dwattr $C$DW$637, DW_AT_decl_column(0x13)
    6484                    
    6485                    $C$DW$638       .dwtag  DW_TAG_member
    6486                            .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$3)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  119

    6487                            .dwattr $C$DW$638, DW_AT_name("pValue")
    6488                            .dwattr $C$DW$638, DW_AT_TI_symbol_name("pValue")
    6489                            .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6490                            .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6491                            .dwattr $C$DW$638, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6492                            .dwattr $C$DW$638, DW_AT_decl_line(0x75)
    6493                            .dwattr $C$DW$638, DW_AT_decl_column(0x0b)
    6494                    
    6495                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6496                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x73)
    6497                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    6498                            .dwendtag $C$DW$T$37
    6499                    
    6500                    $C$DW$T$525     .dwtag  DW_TAG_typedef
    6501                            .dwattr $C$DW$T$525, DW_AT_name("tSimpleLinkSpawnMsg")
    6502                            .dwattr $C$DW$T$525, DW_AT_type(*$C$DW$T$37)
    6503                            .dwattr $C$DW$T$525, DW_AT_language(DW_LANG_C)
    6504                            .dwattr $C$DW$T$525, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    6505                            .dwattr $C$DW$T$525, DW_AT_decl_line(0x76)
    6506                            .dwattr $C$DW$T$525, DW_AT_decl_column(0x02)
    6507                    
    6508                    
    6509                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6510                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    6511                    $C$DW$639       .dwtag  DW_TAG_member
    6512                            .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$10)
    6513                            .dwattr $C$DW$639, DW_AT_name("quot")
    6514                            .dwattr $C$DW$639, DW_AT_TI_symbol_name("quot")
    6515                            .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6516                            .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6517                            .dwattr $C$DW$639, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6518                            .dwattr $C$DW$639, DW_AT_decl_line(0x49)
    6519                            .dwattr $C$DW$639, DW_AT_decl_column(0x16)
    6520                    
    6521                    $C$DW$640       .dwtag  DW_TAG_member
    6522                            .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$10)
    6523                            .dwattr $C$DW$640, DW_AT_name("rem")
    6524                            .dwattr $C$DW$640, DW_AT_TI_symbol_name("rem")
    6525                            .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6526                            .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6527                            .dwattr $C$DW$640, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6528                            .dwattr $C$DW$640, DW_AT_decl_line(0x49)
    6529                            .dwattr $C$DW$640, DW_AT_decl_column(0x1c)
    6530                    
    6531                            .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2
    6532                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x49)
    6533                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    6534                            .dwendtag $C$DW$T$38
    6535                    
    6536                    $C$DW$T$526     .dwtag  DW_TAG_typedef
    6537                            .dwattr $C$DW$T$526, DW_AT_name("div_t")
    6538                            .dwattr $C$DW$T$526, DW_AT_type(*$C$DW$T$38)
    6539                            .dwattr $C$DW$T$526, DW_AT_language(DW_LANG_C)
    6540                            .dwattr $C$DW$T$526, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6541                            .dwattr $C$DW$T$526, DW_AT_decl_line(0x49)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  120

    6542                            .dwattr $C$DW$T$526, DW_AT_decl_column(0x23)
    6543                    
    6544                    
    6545                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6546                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    6547                    $C$DW$641       .dwtag  DW_TAG_member
    6548                            .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$10)
    6549                            .dwattr $C$DW$641, DW_AT_name("quot")
    6550                            .dwattr $C$DW$641, DW_AT_TI_symbol_name("quot")
    6551                            .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6552                            .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6553                            .dwattr $C$DW$641, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6554                            .dwattr $C$DW$641, DW_AT_decl_line(0x4e)
    6555                            .dwattr $C$DW$641, DW_AT_decl_column(0x16)
    6556                    
    6557                    $C$DW$642       .dwtag  DW_TAG_member
    6558                            .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$10)
    6559                            .dwattr $C$DW$642, DW_AT_name("rem")
    6560                            .dwattr $C$DW$642, DW_AT_TI_symbol_name("rem")
    6561                            .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6562                            .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6563                            .dwattr $C$DW$642, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6564                            .dwattr $C$DW$642, DW_AT_decl_line(0x4e)
    6565                            .dwattr $C$DW$642, DW_AT_decl_column(0x1c)
    6566                    
    6567                            .dwattr $C$DW$T$39, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2
    6568                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x4e)
    6569                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    6570                            .dwendtag $C$DW$T$39
    6571                    
    6572                    $C$DW$T$527     .dwtag  DW_TAG_typedef
    6573                            .dwattr $C$DW$T$527, DW_AT_name("ldiv_t")
    6574                            .dwattr $C$DW$T$527, DW_AT_type(*$C$DW$T$39)
    6575                            .dwattr $C$DW$T$527, DW_AT_language(DW_LANG_C)
    6576                            .dwattr $C$DW$T$527, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6577                            .dwattr $C$DW$T$527, DW_AT_decl_line(0x4e)
    6578                            .dwattr $C$DW$T$527, DW_AT_decl_column(0x23)
    6579                    
    6580                    
    6581                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6582                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    6583                    $C$DW$643       .dwtag  DW_TAG_member
    6584                            .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$14)
    6585                            .dwattr $C$DW$643, DW_AT_name("quot")
    6586                            .dwattr $C$DW$643, DW_AT_TI_symbol_name("quot")
    6587                            .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6588                            .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6589                            .dwattr $C$DW$643, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6590                            .dwattr $C$DW$643, DW_AT_decl_line(0x56)
    6591                            .dwattr $C$DW$643, DW_AT_decl_column(0x1c)
    6592                    
    6593                    $C$DW$644       .dwtag  DW_TAG_member
    6594                            .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$14)
    6595                            .dwattr $C$DW$644, DW_AT_name("rem")
    6596                            .dwattr $C$DW$644, DW_AT_TI_symbol_name("rem")
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  121

    6597                            .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6598                            .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6599                            .dwattr $C$DW$644, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.
    6600                            .dwattr $C$DW$644, DW_AT_decl_line(0x56)
    6601                            .dwattr $C$DW$644, DW_AT_decl_column(0x22)
    6602                    
    6603                            .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.2
    6604                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x56)
    6605                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    6606                            .dwendtag $C$DW$T$40
    6607                    
    6608                    $C$DW$T$528     .dwtag  DW_TAG_typedef
    6609                            .dwattr $C$DW$T$528, DW_AT_name("lldiv_t")
    6610                            .dwattr $C$DW$T$528, DW_AT_type(*$C$DW$T$40)
    6611                            .dwattr $C$DW$T$528, DW_AT_language(DW_LANG_C)
    6612                            .dwattr $C$DW$T$528, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6613                            .dwattr $C$DW$T$528, DW_AT_decl_line(0x56)
    6614                            .dwattr $C$DW$T$528, DW_AT_decl_column(0x29)
    6615                    
    6616                    
    6617                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6618                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x24)
    6619                    $C$DW$645       .dwtag  DW_TAG_member
    6620                            .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$9)
    6621                            .dwattr $C$DW$645, DW_AT_name("Flags")
    6622                            .dwattr $C$DW$645, DW_AT_TI_symbol_name("Flags")
    6623                            .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6624                            .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6625                            .dwattr $C$DW$645, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6626                            .dwattr $C$DW$645, DW_AT_decl_line(0x90)
    6627                            .dwattr $C$DW$645, DW_AT_decl_column(0x0b)
    6628                    
    6629                    $C$DW$646       .dwtag  DW_TAG_member
    6630                            .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$13)
    6631                            .dwattr $C$DW$646, DW_AT_name("Len")
    6632                            .dwattr $C$DW$646, DW_AT_TI_symbol_name("Len")
    6633                            .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6634                            .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6635                            .dwattr $C$DW$646, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6636                            .dwattr $C$DW$646, DW_AT_decl_line(0x91)
    6637                            .dwattr $C$DW$646, DW_AT_decl_column(0x0b)
    6638                    
    6639                    $C$DW$647       .dwtag  DW_TAG_member
    6640                            .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$13)
    6641                            .dwattr $C$DW$647, DW_AT_name("MaxSize")
    6642                            .dwattr $C$DW$647, DW_AT_TI_symbol_name("MaxSize")
    6643                            .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6644                            .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6645                            .dwattr $C$DW$647, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6646                            .dwattr $C$DW$647, DW_AT_decl_line(0x92)
    6647                            .dwattr $C$DW$647, DW_AT_decl_column(0x0b)
    6648                    
    6649                    $C$DW$648       .dwtag  DW_TAG_member
    6650                            .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$41)
    6651                            .dwattr $C$DW$648, DW_AT_name("Token")
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  122

    6652                            .dwattr $C$DW$648, DW_AT_TI_symbol_name("Token")
    6653                            .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6654                            .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6655                            .dwattr $C$DW$648, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6656                            .dwattr $C$DW$648, DW_AT_decl_line(0x93)
    6657                            .dwattr $C$DW$648, DW_AT_decl_column(0x0b)
    6658                    
    6659                    $C$DW$649       .dwtag  DW_TAG_member
    6660                            .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$13)
    6661                            .dwattr $C$DW$649, DW_AT_name("StorageSize")
    6662                            .dwattr $C$DW$649, DW_AT_TI_symbol_name("StorageSize")
    6663                            .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6664                            .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6665                            .dwattr $C$DW$649, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6666                            .dwattr $C$DW$649, DW_AT_decl_line(0x94)
    6667                            .dwattr $C$DW$649, DW_AT_decl_column(0x0b)
    6668                    
    6669                    $C$DW$650       .dwtag  DW_TAG_member
    6670                            .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$13)
    6671                            .dwattr $C$DW$650, DW_AT_name("WriteCounter")
    6672                            .dwattr $C$DW$650, DW_AT_TI_symbol_name("WriteCounter")
    6673                            .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6674                            .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6675                            .dwattr $C$DW$650, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6676                            .dwattr $C$DW$650, DW_AT_decl_line(0x95)
    6677                            .dwattr $C$DW$650, DW_AT_decl_column(0x0b)
    6678                    
    6679                            .dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6680                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x8f)
    6681                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    6682                            .dwendtag $C$DW$T$42
    6683                    
    6684                    $C$DW$T$529     .dwtag  DW_TAG_typedef
    6685                            .dwattr $C$DW$T$529, DW_AT_name("SlFsFileInfo_t")
    6686                            .dwattr $C$DW$T$529, DW_AT_type(*$C$DW$T$42)
    6687                            .dwattr $C$DW$T$529, DW_AT_language(DW_LANG_C)
    6688                            .dwattr $C$DW$T$529, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    6689                            .dwattr $C$DW$T$529, DW_AT_decl_line(0x96)
    6690                            .dwattr $C$DW$T$529, DW_AT_decl_column(0x02)
    6691                    
    6692                    
    6693                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6694                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x10)
    6695                    $C$DW$651       .dwtag  DW_TAG_member
    6696                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$41)
    6697                            .dwattr $C$DW$651, DW_AT_name("Key")
    6698                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("Key")
    6699                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6700                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6701                            .dwattr $C$DW$651, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6702                            .dwattr $C$DW$651, DW_AT_decl_line(0xb1)
    6703                            .dwattr $C$DW$651, DW_AT_decl_column(0x0b)
    6704                    
    6705                            .dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6706                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xb0)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  123

    6707                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    6708                            .dwendtag $C$DW$T$43
    6709                    
    6710                    $C$DW$T$530     .dwtag  DW_TAG_typedef
    6711                            .dwattr $C$DW$T$530, DW_AT_name("SlFsKey_t")
    6712                            .dwattr $C$DW$T$530, DW_AT_type(*$C$DW$T$43)
    6713                            .dwattr $C$DW$T$530, DW_AT_language(DW_LANG_C)
    6714                            .dwattr $C$DW$T$530, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    6715                            .dwattr $C$DW$T$530, DW_AT_decl_line(0xb2)
    6716                            .dwattr $C$DW$T$530, DW_AT_decl_column(0x02)
    6717                    
    6718                    
    6719                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6720                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    6721                    $C$DW$652       .dwtag  DW_TAG_member
    6722                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$6)
    6723                            .dwattr $C$DW$652, DW_AT_name("Index")
    6724                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("Index")
    6725                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6726                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6727                            .dwattr $C$DW$652, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6728                            .dwattr $C$DW$652, DW_AT_decl_line(0xb6)
    6729                            .dwattr $C$DW$652, DW_AT_decl_column(0x09)
    6730                    
    6731                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6732                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xb5)
    6733                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    6734                            .dwendtag $C$DW$T$44
    6735                    
    6736                    $C$DW$T$218     .dwtag  DW_TAG_typedef
    6737                            .dwattr $C$DW$T$218, DW_AT_name("SlFsFileNameIndex_t")
    6738                            .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$44)
    6739                            .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    6740                            .dwattr $C$DW$T$218, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    6741                            .dwattr $C$DW$T$218, DW_AT_decl_line(0xb7)
    6742                            .dwattr $C$DW$T$218, DW_AT_decl_column(0x02)
    6743                    
    6744                    
    6745                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6746                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    6747                    $C$DW$653       .dwtag  DW_TAG_member
    6748                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$13)
    6749                            .dwattr $C$DW$653, DW_AT_name("Operation")
    6750                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("Operation")
    6751                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6752                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6753                            .dwattr $C$DW$653, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6754                            .dwattr $C$DW$653, DW_AT_decl_line(0xca)
    6755                            .dwattr $C$DW$653, DW_AT_decl_column(0x08)
    6756                    
    6757                            .dwattr $C$DW$T$45, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6758                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xc9)
    6759                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    6760                            .dwendtag $C$DW$T$45
    6761                    
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  124

    6762                    $C$DW$T$531     .dwtag  DW_TAG_typedef
    6763                            .dwattr $C$DW$T$531, DW_AT_name("SlFsRetToFactoryCommand_t")
    6764                            .dwattr $C$DW$T$531, DW_AT_type(*$C$DW$T$45)
    6765                            .dwattr $C$DW$T$531, DW_AT_language(DW_LANG_C)
    6766                            .dwattr $C$DW$T$531, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    6767                            .dwattr $C$DW$T$531, DW_AT_decl_line(0xcb)
    6768                            .dwattr $C$DW$T$531, DW_AT_decl_column(0x02)
    6769                    
    6770                    
    6771                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6772                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    6773                    $C$DW$654       .dwtag  DW_TAG_member
    6774                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$13)
    6775                            .dwattr $C$DW$654, DW_AT_name("IncludeFilters")
    6776                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("IncludeFilters")
    6777                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6778                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6779                            .dwattr $C$DW$654, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6780                            .dwattr $C$DW$654, DW_AT_decl_line(0xd1)
    6781                            .dwattr $C$DW$654, DW_AT_decl_column(0x12)
    6782                    
    6783                            .dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6784                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xd0)
    6785                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    6786                            .dwendtag $C$DW$T$46
    6787                    
    6788                    $C$DW$T$532     .dwtag  DW_TAG_typedef
    6789                            .dwattr $C$DW$T$532, DW_AT_name("SlFsControl_t")
    6790                            .dwattr $C$DW$T$532, DW_AT_type(*$C$DW$T$46)
    6791                            .dwattr $C$DW$T$532, DW_AT_language(DW_LANG_C)
    6792                            .dwattr $C$DW$T$532, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    6793                            .dwattr $C$DW$T$532, DW_AT_decl_line(0xd3)
    6794                            .dwattr $C$DW$T$532, DW_AT_decl_column(0x02)
    6795                    
    6796                    
    6797                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6798                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x10)
    6799                    $C$DW$655       .dwtag  DW_TAG_member
    6800                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$9)
    6801                            .dwattr $C$DW$655, DW_AT_name("DeviceBlockSize")
    6802                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("DeviceBlockSize")
    6803                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6804                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6805                            .dwattr $C$DW$655, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6806                            .dwattr $C$DW$655, DW_AT_decl_line(0xd7)
    6807                            .dwattr $C$DW$655, DW_AT_decl_column(0x08)
    6808                    
    6809                    $C$DW$656       .dwtag  DW_TAG_member
    6810                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$9)
    6811                            .dwattr $C$DW$656, DW_AT_name("DeviceBlocksCapacity")
    6812                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
    6813                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6814                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6815                            .dwattr $C$DW$656, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6816                            .dwattr $C$DW$656, DW_AT_decl_line(0xd8)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  125

    6817                            .dwattr $C$DW$656, DW_AT_decl_column(0x08)
    6818                    
    6819                    $C$DW$657       .dwtag  DW_TAG_member
    6820                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$9)
    6821                            .dwattr $C$DW$657, DW_AT_name("NumOfAllocatedBlocks")
    6822                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
    6823                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6824                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6825                            .dwattr $C$DW$657, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6826                            .dwattr $C$DW$657, DW_AT_decl_line(0xd9)
    6827                            .dwattr $C$DW$657, DW_AT_decl_column(0x08)
    6828                    
    6829                    $C$DW$658       .dwtag  DW_TAG_member
    6830                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$9)
    6831                            .dwattr $C$DW$658, DW_AT_name("NumOfReservedBlocks")
    6832                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("NumOfReservedBlocks")
    6833                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6834                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6835                            .dwattr $C$DW$658, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6836                            .dwattr $C$DW$658, DW_AT_decl_line(0xda)
    6837                            .dwattr $C$DW$658, DW_AT_decl_column(0x08)
    6838                    
    6839                    $C$DW$659       .dwtag  DW_TAG_member
    6840                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$9)
    6841                            .dwattr $C$DW$659, DW_AT_name("NumOfReservedBlocksForSystemfiles")
    6842                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
    6843                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6844                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6845                            .dwattr $C$DW$659, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6846                            .dwattr $C$DW$659, DW_AT_decl_line(0xdb)
    6847                            .dwattr $C$DW$659, DW_AT_decl_column(0x08)
    6848                    
    6849                    $C$DW$660       .dwtag  DW_TAG_member
    6850                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$9)
    6851                            .dwattr $C$DW$660, DW_AT_name("LargestAllocatedGapInBlocks")
    6852                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
    6853                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6854                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6855                            .dwattr $C$DW$660, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6856                            .dwattr $C$DW$660, DW_AT_decl_line(0xdc)
    6857                            .dwattr $C$DW$660, DW_AT_decl_column(0x08)
    6858                    
    6859                    $C$DW$661       .dwtag  DW_TAG_member
    6860                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$9)
    6861                            .dwattr $C$DW$661, DW_AT_name("NumOfAvailableBlocksForUserFiles")
    6862                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
    6863                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6864                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6865                            .dwattr $C$DW$661, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6866                            .dwattr $C$DW$661, DW_AT_decl_line(0xdd)
    6867                            .dwattr $C$DW$661, DW_AT_decl_column(0x08)
    6868                    
    6869                    $C$DW$662       .dwtag  DW_TAG_member
    6870                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$47)
    6871                            .dwattr $C$DW$662, DW_AT_name("Padding")
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  126

    6872                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("Padding")
    6873                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6874                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6875                            .dwattr $C$DW$662, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6876                            .dwattr $C$DW$662, DW_AT_decl_line(0xde)
    6877                            .dwattr $C$DW$662, DW_AT_decl_column(0x08)
    6878                    
    6879                            .dwattr $C$DW$T$48, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6880                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xd6)
    6881                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    6882                            .dwendtag $C$DW$T$48
    6883                    
    6884                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    6885                            .dwattr $C$DW$T$50, DW_AT_name("SlFsControlDeviceUsage_t")
    6886                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$48)
    6887                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6888                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    6889                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xdf)
    6890                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    6891                    
    6892                    
    6893                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    6894                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x14)
    6895                    $C$DW$663       .dwtag  DW_TAG_member
    6896                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$6)
    6897                            .dwattr $C$DW$663, DW_AT_name("MaxFsFiles")
    6898                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("MaxFsFiles")
    6899                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6900                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6901                            .dwattr $C$DW$663, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6902                            .dwattr $C$DW$663, DW_AT_decl_line(0xe3)
    6903                            .dwattr $C$DW$663, DW_AT_decl_column(0x08)
    6904                    
    6905                    $C$DW$664       .dwtag  DW_TAG_member
    6906                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$6)
    6907                            .dwattr $C$DW$664, DW_AT_name("IsDevlopmentFormatType")
    6908                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
    6909                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6910                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6911                            .dwattr $C$DW$664, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6912                            .dwattr $C$DW$664, DW_AT_decl_line(0xe4)
    6913                            .dwattr $C$DW$664, DW_AT_decl_column(0x08)
    6914                    
    6915                    $C$DW$665       .dwtag  DW_TAG_member
    6916                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$6)
    6917                            .dwattr $C$DW$665, DW_AT_name("Bundlestate")
    6918                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("Bundlestate")
    6919                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6920                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6921                            .dwattr $C$DW$665, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6922                            .dwattr $C$DW$665, DW_AT_decl_line(0xe5)
    6923                            .dwattr $C$DW$665, DW_AT_decl_column(0x08)
    6924                    
    6925                    $C$DW$666       .dwtag  DW_TAG_member
    6926                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  127

    6927                            .dwattr $C$DW$666, DW_AT_name("Reserved")
    6928                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("Reserved")
    6929                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6930                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6931                            .dwattr $C$DW$666, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6932                            .dwattr $C$DW$666, DW_AT_decl_line(0xe6)
    6933                            .dwattr $C$DW$666, DW_AT_decl_column(0x08)
    6934                    
    6935                    $C$DW$667       .dwtag  DW_TAG_member
    6936                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$6)
    6937                            .dwattr $C$DW$667, DW_AT_name("MaxFsFilesReservedForSysFiles")
    6938                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
    6939                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6940                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6941                            .dwattr $C$DW$667, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6942                            .dwattr $C$DW$667, DW_AT_decl_line(0xe7)
    6943                            .dwattr $C$DW$667, DW_AT_decl_column(0x08)
    6944                    
    6945                    $C$DW$668       .dwtag  DW_TAG_member
    6946                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$6)
    6947                            .dwattr $C$DW$668, DW_AT_name("ActualNumOfUserFiles")
    6948                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
    6949                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6950                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6951                            .dwattr $C$DW$668, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6952                            .dwattr $C$DW$668, DW_AT_decl_line(0xe8)
    6953                            .dwattr $C$DW$668, DW_AT_decl_column(0x08)
    6954                    
    6955                    $C$DW$669       .dwtag  DW_TAG_member
    6956                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$6)
    6957                            .dwattr $C$DW$669, DW_AT_name("ActualNumOfSysFiles")
    6958                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
    6959                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6960                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6961                            .dwattr $C$DW$669, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6962                            .dwattr $C$DW$669, DW_AT_decl_line(0xe9)
    6963                            .dwattr $C$DW$669, DW_AT_decl_column(0x08)
    6964                    
    6965                    $C$DW$670       .dwtag  DW_TAG_member
    6966                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$6)
    6967                            .dwattr $C$DW$670, DW_AT_name("Padding")
    6968                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("Padding")
    6969                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6970                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6971                            .dwattr $C$DW$670, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6972                            .dwattr $C$DW$670, DW_AT_decl_line(0xea)
    6973                            .dwattr $C$DW$670, DW_AT_decl_column(0x08)
    6974                    
    6975                    $C$DW$671       .dwtag  DW_TAG_member
    6976                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$13)
    6977                            .dwattr $C$DW$671, DW_AT_name("NumOfAlerts")
    6978                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("NumOfAlerts")
    6979                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6980                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6981                            .dwattr $C$DW$671, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  128

    6982                            .dwattr $C$DW$671, DW_AT_decl_line(0xeb)
    6983                            .dwattr $C$DW$671, DW_AT_decl_column(0x08)
    6984                    
    6985                    $C$DW$672       .dwtag  DW_TAG_member
    6986                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$13)
    6987                            .dwattr $C$DW$672, DW_AT_name("NumOfAlertsThreshold")
    6988                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
    6989                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6990                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6991                            .dwattr $C$DW$672, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    6992                            .dwattr $C$DW$672, DW_AT_decl_line(0xec)
    6993                            .dwattr $C$DW$672, DW_AT_decl_column(0x08)
    6994                    
    6995                    $C$DW$673       .dwtag  DW_TAG_member
    6996                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$9)
    6997                            .dwattr $C$DW$673, DW_AT_name("FATWriteCounter")
    6998                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("FATWriteCounter")
    6999                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7000                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7001                            .dwattr $C$DW$673, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7002                            .dwattr $C$DW$673, DW_AT_decl_line(0xed)
    7003                            .dwattr $C$DW$673, DW_AT_decl_column(0x08)
    7004                    
    7005                    $C$DW$674       .dwtag  DW_TAG_member
    7006                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$9)
    7007                            .dwattr $C$DW$674, DW_AT_name("Padding2")
    7008                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("Padding2")
    7009                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7010                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7011                            .dwattr $C$DW$674, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7012                            .dwattr $C$DW$674, DW_AT_decl_line(0xee)
    7013                            .dwattr $C$DW$674, DW_AT_decl_column(0x08)
    7014                    
    7015                            .dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    7016                            .dwattr $C$DW$T$49, DW_AT_decl_line(0xe2)
    7017                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    7018                            .dwendtag $C$DW$T$49
    7019                    
    7020                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    7021                            .dwattr $C$DW$T$51, DW_AT_name("SlFsControlFilesUsage_t")
    7022                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    7023                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7024                            .dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    7025                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xef)
    7026                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x02)
    7027                    
    7028                    
    7029                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    7030                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x24)
    7031                    $C$DW$675       .dwtag  DW_TAG_member
    7032                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$50)
    7033                            .dwattr $C$DW$675, DW_AT_name("DeviceUsage")
    7034                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("DeviceUsage")
    7035                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7036                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  129

    7037                            .dwattr $C$DW$675, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7038                            .dwattr $C$DW$675, DW_AT_decl_line(0xf4)
    7039                            .dwattr $C$DW$675, DW_AT_decl_column(0x1e)
    7040                    
    7041                    $C$DW$676       .dwtag  DW_TAG_member
    7042                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$51)
    7043                            .dwattr $C$DW$676, DW_AT_name("FilesUsage")
    7044                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("FilesUsage")
    7045                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7046                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7047                            .dwattr $C$DW$676, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7048                            .dwattr $C$DW$676, DW_AT_decl_line(0xf5)
    7049                            .dwattr $C$DW$676, DW_AT_decl_column(0x1e)
    7050                    
    7051                            .dwattr $C$DW$T$52, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    7052                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xf3)
    7053                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    7054                            .dwendtag $C$DW$T$52
    7055                    
    7056                    $C$DW$T$533     .dwtag  DW_TAG_typedef
    7057                            .dwattr $C$DW$T$533, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
    7058                            .dwattr $C$DW$T$533, DW_AT_type(*$C$DW$T$52)
    7059                            .dwattr $C$DW$T$533, DW_AT_language(DW_LANG_C)
    7060                            .dwattr $C$DW$T$533, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    7061                            .dwattr $C$DW$T$533, DW_AT_decl_line(0xf6)
    7062                            .dwattr $C$DW$T$533, DW_AT_decl_column(0x03)
    7063                    
    7064                    
    7065                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    7066                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x0c)
    7067                    $C$DW$677       .dwtag  DW_TAG_member
    7068                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$13)
    7069                            .dwattr $C$DW$677, DW_AT_name("IncludeFilters")
    7070                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("IncludeFilters")
    7071                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7072                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7073                            .dwattr $C$DW$677, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7074                            .dwattr $C$DW$677, DW_AT_decl_line(0xfa)
    7075                            .dwattr $C$DW$677, DW_AT_decl_column(0x0b)
    7076                    
    7077                    $C$DW$678       .dwtag  DW_TAG_member
    7078                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$6)
    7079                            .dwattr $C$DW$678, DW_AT_name("OpenedForWriteCnt")
    7080                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("OpenedForWriteCnt")
    7081                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7082                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7083                            .dwattr $C$DW$678, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7084                            .dwattr $C$DW$678, DW_AT_decl_line(0xfb)
    7085                            .dwattr $C$DW$678, DW_AT_decl_column(0x0b)
    7086                    
    7087                    $C$DW$679       .dwtag  DW_TAG_member
    7088                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$6)
    7089                            .dwattr $C$DW$679, DW_AT_name("OpeneForReadCnt")
    7090                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("OpeneForReadCnt")
    7091                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  130

    7092                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7093                            .dwattr $C$DW$679, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7094                            .dwattr $C$DW$679, DW_AT_decl_line(0xfc)
    7095                            .dwattr $C$DW$679, DW_AT_decl_column(0x0b)
    7096                    
    7097                    $C$DW$680       .dwtag  DW_TAG_member
    7098                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$6)
    7099                            .dwattr $C$DW$680, DW_AT_name("ClosedFilesCnt")
    7100                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("ClosedFilesCnt")
    7101                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7102                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7103                            .dwattr $C$DW$680, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7104                            .dwattr $C$DW$680, DW_AT_decl_line(0xfd)
    7105                            .dwattr $C$DW$680, DW_AT_decl_column(0x0b)
    7106                    
    7107                    $C$DW$681       .dwtag  DW_TAG_member
    7108                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$6)
    7109                            .dwattr $C$DW$681, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
    7110                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
    7111                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7112                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7113                            .dwattr $C$DW$681, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7114                            .dwattr $C$DW$681, DW_AT_decl_line(0xfe)
    7115                            .dwattr $C$DW$681, DW_AT_decl_column(0x0b)
    7116                    
    7117                    $C$DW$682       .dwtag  DW_TAG_member
    7118                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$6)
    7119                            .dwattr $C$DW$682, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
    7120                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
    7121                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7122                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7123                            .dwattr $C$DW$682, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7124                            .dwattr $C$DW$682, DW_AT_decl_line(0xff)
    7125                            .dwattr $C$DW$682, DW_AT_decl_column(0x0b)
    7126                    
    7127                    $C$DW$683       .dwtag  DW_TAG_member
    7128                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$6)
    7129                            .dwattr $C$DW$683, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
    7130                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
    7131                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7132                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7133                            .dwattr $C$DW$683, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7134                            .dwattr $C$DW$683, DW_AT_decl_line(0x100)
    7135                            .dwattr $C$DW$683, DW_AT_decl_column(0x0b)
    7136                    
    7137                    $C$DW$684       .dwtag  DW_TAG_member
    7138                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$47)
    7139                            .dwattr $C$DW$684, DW_AT_name("padding")
    7140                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("padding")
    7141                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7142                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7143                            .dwattr $C$DW$684, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7144                            .dwattr $C$DW$684, DW_AT_decl_line(0x101)
    7145                            .dwattr $C$DW$684, DW_AT_decl_column(0x0b)
    7146                    
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  131

    7147                            .dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    7148                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xf9)
    7149                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    7150                            .dwendtag $C$DW$T$53
    7151                    
    7152                    $C$DW$T$534     .dwtag  DW_TAG_typedef
    7153                            .dwattr $C$DW$T$534, DW_AT_name("SlFsControlGetCountersResponse_t")
    7154                            .dwattr $C$DW$T$534, DW_AT_type(*$C$DW$T$53)
    7155                            .dwattr $C$DW$T$534, DW_AT_language(DW_LANG_C)
    7156                            .dwattr $C$DW$T$534, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    7157                            .dwattr $C$DW$T$534, DW_AT_decl_line(0x102)
    7158                            .dwattr $C$DW$T$534, DW_AT_decl_column(0x03)
    7159                    
    7160                    
    7161                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    7162                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x0c)
    7163                    $C$DW$685       .dwtag  DW_TAG_member
    7164                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$13)
    7165                            .dwattr $C$DW$685, DW_AT_name("FileMaxSize")
    7166                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("FileMaxSize")
    7167                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7168                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7169                            .dwattr $C$DW$685, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7170                            .dwattr $C$DW$685, DW_AT_decl_line(0x111)
    7171                            .dwattr $C$DW$685, DW_AT_decl_column(0x0a)
    7172                    
    7173                    $C$DW$686       .dwtag  DW_TAG_member
    7174                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$13)
    7175                            .dwattr $C$DW$686, DW_AT_name("Properties")
    7176                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("Properties")
    7177                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7178                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7179                            .dwattr $C$DW$686, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7180                            .dwattr $C$DW$686, DW_AT_decl_line(0x112)
    7181                            .dwattr $C$DW$686, DW_AT_decl_column(0x0a)
    7182                    
    7183                    $C$DW$687       .dwtag  DW_TAG_member
    7184                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$13)
    7185                            .dwattr $C$DW$687, DW_AT_name("FileAllocatedBlocks")
    7186                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("FileAllocatedBlocks")
    7187                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7188                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7189                            .dwattr $C$DW$687, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7190                            .dwattr $C$DW$687, DW_AT_decl_line(0x113)
    7191                            .dwattr $C$DW$687, DW_AT_decl_column(0x0a)
    7192                    
    7193                            .dwattr $C$DW$T$54, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    7194                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x110)
    7195                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    7196                            .dwendtag $C$DW$T$54
    7197                    
    7198                    $C$DW$T$535     .dwtag  DW_TAG_typedef
    7199                            .dwattr $C$DW$T$535, DW_AT_name("SlFileAttributes_t")
    7200                            .dwattr $C$DW$T$535, DW_AT_type(*$C$DW$T$54)
    7201                            .dwattr $C$DW$T$535, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  132

    7202                            .dwattr $C$DW$T$535, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    7203                            .dwattr $C$DW$T$535, DW_AT_decl_line(0x114)
    7204                            .dwattr $C$DW$T$535, DW_AT_decl_column(0x02)
    7205                    
    7206                    
    7207                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    7208                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
    7209                    $C$DW$688       .dwtag  DW_TAG_member
    7210                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$13)
    7211                            .dwattr $C$DW$688, DW_AT_name("KeepaliveEnabled")
    7212                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("KeepaliveEnabled")
    7213                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7214                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7215                            .dwattr $C$DW$688, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7216                            .dwattr $C$DW$688, DW_AT_decl_line(0xf6)
    7217                            .dwattr $C$DW$688, DW_AT_decl_column(0x0a)
    7218                    
    7219                            .dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    7220                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xf5)
    7221                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    7222                            .dwendtag $C$DW$T$55
    7223                    
    7224                    $C$DW$T$536     .dwtag  DW_TAG_typedef
    7225                            .dwattr $C$DW$T$536, DW_AT_name("SlSockKeepalive_t")
    7226                            .dwattr $C$DW$T$536, DW_AT_type(*$C$DW$T$55)
    7227                            .dwattr $C$DW$T$536, DW_AT_language(DW_LANG_C)
    7228                            .dwattr $C$DW$T$536, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    7229                            .dwattr $C$DW$T$536, DW_AT_decl_line(0xf7)
    7230                            .dwattr $C$DW$T$536, DW_AT_decl_column(0x02)
    7231                    
    7232                    
    7233                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    7234                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    7235                    $C$DW$689       .dwtag  DW_TAG_member
    7236                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$13)
    7237                            .dwattr $C$DW$689, DW_AT_name("ReuseaddrEnabled")
    7238                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("ReuseaddrEnabled")
    7239                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7240                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7241                            .dwattr $C$DW$689, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7242                            .dwattr $C$DW$689, DW_AT_decl_line(0xfb)
    7243                            .dwattr $C$DW$689, DW_AT_decl_column(0x0a)
    7244                    
    7245                            .dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    7246                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xfa)
    7247                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    7248                            .dwendtag $C$DW$T$56
    7249                    
    7250                    $C$DW$T$537     .dwtag  DW_TAG_typedef
    7251                            .dwattr $C$DW$T$537, DW_AT_name("SlSockReuseaddr_t")
    7252                            .dwattr $C$DW$T$537, DW_AT_type(*$C$DW$T$56)
    7253                            .dwattr $C$DW$T$537, DW_AT_language(DW_LANG_C)
    7254                            .dwattr $C$DW$T$537, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/
    7255                            .dwattr $C$DW$T$537, DW_AT_decl_line(0xfc)
    7256                            .dwattr $C$DW$T$537, DW_AT_decl_column(0x02)
TI ARM Assembler Unix v18.1.2 Thu Jun 14 14:56:57 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  133

    7257                    
    7258                    
    7259                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    7260                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x04)
    7261                    $C$DW$690       .dwtag  DW_TAG_member
    7262                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$12)
    7263                            .dwattr $C$DW$690, DW_AT_name("RxIpNoBoundaryEnabled")
    7264                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("RxIpNoBoundaryEnabled")
    7265                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7266                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7267                            .dwattr $C$DW$690, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/ne
    7268                            .dwattr $C$DW$690, DW_AT_decl_line(0x100)
    7269                            .dwattr $C$DW$690, DW_AT_decl_column(0x0a)
    7270                    
    7271                            .dwattr $C$DW$T$57, DW_AT_decl_file("/vagrant/SDK_Q2_GA_Gen2_Only/sdk_root/source/ti/drivers/n
    7272                            .dwattr $C$DW$T$57, DW_AT_decl_line(0xff)
    7273                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    7274                            .dwendtag $C$DW$T$57
